Revit 2027 API
BuiltInFailures.WallFailures.CannotSplitVerticallyCompoundWall Property
 Can't divide Wall's face to assign different materials to a vertically compound Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotSplitVerticallyCompoundWall { get; }
Public Shared ReadOnly Property CannotSplitVerticallyCompoundWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotSplitVerticallyCompoundWall {
	FailureDefinitionId^ get ();
}
static member CannotSplitVerticallyCompoundWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace